app/controllers/posts_controller.rb

INSERT INTO "posts" ("created_at", "description", "title", "updated_at", "url") VALUES (?, ?, ?, ?, ?)  [["created_at", Wed, 30 Jul 2014 16:37:07 UTC +00:00], ["description", "Tech news"], ["title", "Wired"], ["updated_at", Wed, 30 Jul 2014 16:37:07 UTC +00:00], ["url", "wired.co.uk"]]
---
  def create
    @post = Post.new(post_params)
    @post.creator = current_user
    if @post.save