app/controllers/users_controller.rb

  def create
     @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("created_at", "password_digest", "updated_at") VALUES (?, ?, ?)  [["created_at", Fri, 08 Aug 2014 13:25:24 UTC +00:00], ["password_digest", "$2a$10$.JJS7G0OX5y3b65Ht18g2OI0pJPMWIhikFTGG4bwwANqtuYoa6v4C"], ["updated_at", Fri, 08 Aug 2014 13:25:24 UTC +00:00]]